#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.IAM.data.aws_iam_policy_document.s3_full_access: Reading...
module.IAM.data.aws_iam_policy_document.assume_role1: Reading...
module.IAM.data.aws_iam_policy_document.assume_role1: Read complete after 0s [id=3289593110]
module.IAM.data.aws_iam_policy_document.s3_full_access: Read complete after 0s [id=1765856792]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.IAM.aws_iam_group.devops will be created
  + resource "aws_iam_group" "devops" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "DevOps"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.IAM.aws_iam_group_membership.devops-team will be created
  + resource "aws_iam_group_membership" "devops-team" {
      + group = "DevOps"
      + id    = (known after apply)
      + name  = "devops team membership"
      + users = [
          + "malik",
        ]
    }

  # module.IAM.aws_iam_group_policy.developer_policy will be created
  + resource "aws_iam_group_policy" "developer_policy" {
      + group  = "DevOps"
      + id     = (known after apply)
      + name   = "Developer-Policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.IAM.aws_iam_policy.Ec2-full-Access will be created
  + resource "aws_iam_policy" "Ec2-full-Access" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "ec2-ful-access"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VisualEditor0"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.IAM.aws_iam_policy_attachment.test-attach will be created
  + resource "aws_iam_policy_attachment" "test-attach" {
      + id         = (known after apply)
      + name       = "test-atatchement-user-EC2-Access"
      + policy_arn = (known after apply)
      + users      = [
          + "malik",
        ]
    }

  # module.IAM.aws_iam_role.Ec2_role will be created
  + resource "aws_iam_role" "Ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Ec2_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "name" = "EC2_Role"
        }
      + tags_all              = {
          + "name" = "EC2_Role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.IAM.aws_iam_role.test_role will be created
  + resource "aws_iam_role" "test_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "S3-Access"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Role" = "Test-Role"
        }
      + tags_all              = {
          + "Role" = "Test-Role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.IAM.aws_iam_role_policy.Ec2_access_S3_full_access will be created
  + resource "aws_iam_role_policy" "Ec2_access_S3_full_access" {
      + id     = (known after apply)
      + name   = "EC2_full_access_to_S3"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "s3-object-lambda:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "Ec2_role"
    }

  # module.IAM.aws_iam_user.illthizam will be created
  + resource "aws_iam_user" "illthizam" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "malik"
      + path          = "/"
      + tags          = {
          + "name" = "user"
        }
      + tags_all      = {
          + "name" = "user"
        }
      + unique_id     = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @sham97, Action: `pull_request`*